# MAIN
# ==================================================
# http://www.behindthename.com + filter ИМЕНА
# https://tekeli.li/onomastikon/ ФАМИЛИИ
# convertcase https://convertcase.net/
# ==================================================

# fantasynamegenerators.com - угарный генератор, дохрена имен

# Русские имена и фамилии -- 1,5,10,12,23
# Английские имена и фамилии -- 2,13,24
# Ирландские имена и фамилии -- 3,25
# Шотландские имена и фамилии -- 4,26
# Болгарские имена и фамилии -- 27,33
# Венгерские имена и фамилии -- 6,28
# Датские имена и фамилии -- 7,29
# Исландские имена и фамилии -- 8,11,31
# Испанские имена и фамилии -- 9,14,30
# Итальянские имена и фамилии -- 15,16,32
# Немецкие имена и фамилии -- 17,34,40
# Голландские имена и фамилии -- 18,19,39
# Норвежские имена и фамилии -- 20,35,41
# Польские имена и фамилии -- 21,36
# Португальские имена и фамилии -- 22,37,44
# Бразильские имена и фамилии -- 38,42,47
# Румынские и молдавские имена и фамилии -- 43,45
# Финские имена и фамилии -- 46,48
# Французские имена и фамилии -- 49,51,53
# Чешские имена и фамилии -- 50,54
# Шведские имена и фамилии -- 52,55
# Сербские и черногорские имена и фамилии -- 56,58
# Израильские имена и фамилии -- 57,59
# Афганские имена и фамилии (?)
# Украинские имена и фамилии -- 60,63
# Грузинские имена и фамилии -- 64
# Армянские имена и фамилии -- 66
# Индонезийские имена и фамилии -- 69
# Алжирские фамилии -- 71
# Иранские имена и фамилии -- 65,70