# MAIN
# ==================================================
# http://www.behindthename.com + filter ИМЕНА
# https://tekeli.li/onomastikon/ ФАМИЛИИ
# convertcase https://convertcase.net/
# ==================================================

# fantasynamegenerators.com - угарный генератор, дохрена имен

# ОСТАЛОСЬ::::::::


# АФРИКА
# https://tekeli.li/onomastikon/Africa/Central/index.html
# https://tekeli.li/onomastikon/Africa/Western/index.html
# https://tekeli.li/onomastikon/Africa/Southern/index.html

# АЗИЯ:
# https://tekeli.li/onomastikon/Middle-East/index.html
# https://tekeli.li/onomastikon/Orient/index.html

# АМЕРИКА:
# https://tekeli.li/onomastikon/America/index.html

# ОКЕАНИЯ:
# https://tekeli.li/onomastikon/Pacific/index.html

# Русские имена и фамилии -- 1,5,10,12,23
# Английские имена и фамилии -- 2,13,24
# Ирландские имена и фамилии -- 3,25

# @irl_lastnames = ["Барри","Бойл","Брэди","Бреннан","Броуди","Брк","Батлер","Брн","Кэри","Кэйси","Клэнси","Конаган","Коннолли","Конрой","Коркоран","Кроули","Каннингэм","Дэйли","Доэрти","Донахью","Донелли","Донован","Дойл","Дрисколл","Даффи","Фаррелл","Фицджералд","Фицпатрик","Флаэрти","Фланаган","Флинн","Фоули","Галлахер","Гриффин","Хили","Хеннесси","Хиггингс","Хоган","Кэйн","Кин","Келли","Кеннеди","Кенни","Киллоран","Лири","Ли","Линч","Маколи","Маккормак","Макдермотт","Макдоналд","Маккенна","Макмахон","Макнамара","Маги","Магуайр","Махони","Мэлоун","Макбрайд","Маккарти","Маккормик","Макдоннелл","Макэлрой","Макги","Макгинн","Маклафлин","Максуини","Монаган","Мур","Моран","Мрфи","Мюррей","Нил","Нолан","О’Брн","О’Бойл","О’Брайан","О’Каллахан","О’Кэрролл","О’Кэйси","О’Коннелл","О’Коннор","О’Доэрти",
#                  "О’Доннелл","О’Донован","О’Дрисколл","О’Фаррелл","О’Флаэрти","О’Галлахер","О’Горман","О’Грэди","О’Хэллоран","О’Киф","О’Келли","О’Лири","О’Махони","О’Мур","О’Нил","О’Куинн","О’Рейли","О’Риордан","О’Рурк","О’Райан","О’Ши","О’Салливан","О’Тул","Куинн","Рафферти","Редмонд","Рейли","Райли","Рурк","Райан","Скалли","Шиан","Шеридан","Салливан","Суини","Уолш","Бэннон","Берриган","Брэйден","Брэдиган","Брэниган","Бренниган","Бри","Бреслин","Броган","Канаван","Кэссиди","Коди","Коннери","Дуэйн","Донеган","Дилэйни","Финнеган","Фаррен","Фланнери","Гиллан","Хэнлон","Киган","Кинан","Кеннан","Лэйси","Мэдиган","Миган","Рейган","Трэйси","Флэтли","Фитцсиммонс","Финли","Маклеллан","Лонерган","Маккаффри","Маккартан","Макклин","О’Кэйн","Керриган","Киркпатрик","Макинтайр","Макгоннелл","Макгрэйн",
#                  "Далтон","Дреннан","Мэнникс","Мэддокс","Морган","Макмюррей","Джойс","О’Лэниган"]
# Шотландские имена и фамилии -- 4,26
# @sct_lastnames = ["Хаттон","Адамс","Адамсон","Эллисон","Андерсон","Армстронг","Бэйли","Бэйн","Бэйрд","Баркли","Барр","Бакстер","Битон","Белл","Блэр","Бойд","Бойл","Броуди","Брюс","Бухан","Буханан","Брнс","Гилкрист","Кэйрнс","Кэмерон","Кэмпбелл","Кармайкл","Чисхолм","Кристи","Кохран","Коуан","Коуи","Камминг","Каннингэм","Дэвидсон","Доусон","Дик","Диксон","Доналдсон","Драммонд","Дафф","Даффи","Дункан","Данлоп","Данн","Эллиот","Фергюсон","Финдли","Финлисон","Флеминг","Форбс","Файф","Галлахер","Гибб","Гибсон","Гиллеспи","Гиллис","Гилмур","Гордон","Грэм","Грант","Грэйг","Хэмилтон","Хендерсон","Хендри","Хогг","Хатчисон","Инглис","Иннес","Джемисон","Келли","Кеннеди","Керр","Кирк","Лэйрд","Лэнг","Лоури","Лоусон","Лесли","Линдси","Ливингстоун","Макдоналд","Макфарлейн","Маккензи","Маклин","Маклауд",
#                  "Макферсон","Мэнсон","Мэтисон","Макалистер","Макартур","Макбрайд","Маккаллум","Макколл","Маккормик","Макдугалл","Макгилл","Макгоуэн","Макгрегор","Макгуайр","Макиннес","Макинтош","Макинтайр","Маккэй","Маккиннон","Маклахлан","Макларен","Маклеллан","Макленнан","Макмиллан","Макнил","Милн","Монтгомери","Мур","Морган","Моррис","Морриссон","Манро","Мрдок","Мрфи","Мюррей","Нилсон","Николсон","Нисбет","Пэйтон","Робб","Скотт","Синклер","Стивенсон","Стюарт","Томпсон","Уоллис","Макдэниэл","Логан","Маккуин","Маккэйн","Макгроу","Несбитт","Макдаффи","Маккинни","Макки","Макдауэл","Макнайт","Эбернети","Макхью","Боуи","Макадамс"]
# Болгарские имена и фамилии -- 27,33
# Венгерские имена и фамилии -- 6,28
# Датские имена и фамилии -- 7,29
# Исландские имена и фамилии -- 8,11,31
# Испанские имена и фамилии -- 9,14,30
# Итальянские имена и фамилии -- 15,16,32
# Немецкие имена и фамилии -- 17,34,40
# Голландские имена и фамилии -- 18,19,39
# Норвежские имена и фамилии -- 20,35,41
# Польские имена и фамилии -- 21,36
# Португальские имена и фамилии -- 22,37,44
# Бразильские имена и фамилии -- 38,42,47
# @bra_names = ["Аделину","Адриану","Афонсу","Айртон","Алешандри","Алфреду","Амадеу","Андерсон","Андре","Анжелу","Анибал","Антониу","Арманду","Артур","Аугусту","Аурелиу","Балтазар","Бенедиту","Бенту","Бернарду","Бриан","Бруну","Кайю","Карлус","Карлус Эдуарду","Кассиу","Клаудиу","Даниэл","Данилу","Дави","Давид","Денилсон","Дерек","Диегу","Дьогу","Домингус","Эдисон","Эдсон","Эдуарду","Элиас","Эмануэл","Эрик","Эужениу","Фабиу","Фелипе","Фернанду","Филипе","Флавиу","Франсиску","Габриэл","Габриэл Энрике","Джовани","Жералду","Жилберту","Джованни","Гонсалу","Гильерме","Густаву","Эйтор","Энрике","Эрман","Ягу","Ян","Игор","Изаак","Изаки","Иван","Жерониму","Жуан","Жуан Батиста","Жуан Габриэл","Жуан Гильерме",
#              "Жуан Энрике","Жуан Лукас","Жуан Педру","Жуан Витор","Жуакин","Жонатас","Жонатан","Жоржи","Жозе","Жулиу","Жулиу Сезар","Кевин","Клебер","Леандру","Леонарду","Леви","Лоренсу","Лука","Лукас","Лукас Габриэл","Лукка","Лусиану","Луис","Луис Эдуарду","Луис Фелипе","Луис Фернанду","Луис Гильерме","Луис Густаву","Луис Энрике","Мануэл","Марселу","Марсиу","Марку","Марку Антониу","Маркус","Мариу","Мартин","Матеус","Матеус Энрике","Мауру",
#              "Мигел","Милтон","Мойзес","Натан","Нелсон","Николас","Отавиу","Орланду","Освалду","Паулу","Педру","Педру Энрике","Педру Лукас","Рафаэл","Раул","Ренату","Рикарду","Роберту","Родригу","Роналду","Рубенс","Руй","Салвадор","Самуэл","Себастьян","Сержиу","Теодору","Тьягу","Томас","Вагнер","Валдомиру","Васку","Вержилиу","Витор","Витор Габриэл","Виториу","Винисиус","Виторину","Валтер","Вашингтон","Вильям","Вилсон"]
# @bra_lastnames = ["ди Абреу","Абреу","Аффонсу","Айрес","Алкайди","Алкантара","Алдейя","Алейшу","Аленкар","Аленкастри","ди Алмада","Алмада","ди Алмейда","Алмейда","Алваренга","Алварес","Алвару","Алвес","Амаду","ду Амарал","Амарал","Амаранте","Амару","Аморин","ди Андради","Андради","Анжелин","Анхус","Антас","Антунес","Акину","Арагон","Аранья","Арантес","Араужу","Арруда","Ассунсан","Авейру","Авелар","Авила","Азамбужа","Азенья","Азереду","ди Азеведу","Азеведу","Баселар","Балсеман","Бандейра","Батиста","Барата","Баратейру","Барбоза","Баррейру","Баррету","ди Баррус","Баррус","Баррозу","Бастус","Белен","Белмонти","Белу","Белтран","Беневидес","Бентес","Бенту","Бернардес","Бикалью","Бонилья",
#                  "Борба","Боржес","Боржа","Ботелью","Брага","Бранку","Брас","Бугалью","Кабрал","Кабрейра","Каэтану","Кайяду","Кайрес","Калдас","Калдейра","Камара","Камаринью","Камелу","Камилу","Каминья","ди Каминья","Кампелу","Кампус","Канариу","Кандал","Канеду","Канежу","Канела","Канту","Капистрану","Карлус","Кармона","Карнейру","Каррейра","Каррейру","Каррилью","Карвальял","ди Карвалью","Карвалью","Казаду","Каскейра","Кастанью","Кастельяну","Кастелу","Кастел-Бранку","Кастилью","Кастильюс","ди Кастру","Кастру","Кавальейру","Сервейра","Сезар","Сезариу","Шагас","Шавес","Сиприану","Клементину","Коэлью","Коимбра","да Консейсан","Консейсан","Кордейру","Коррейя","Корте-Реал","Кортес","Коста","да Коста","Круз","да Кунья","Кунья",
#                  "Кустодиу","Дамазиу","Делгаду","Диас","Диегес","Динис","Домингус","Домингес","Дуарти","ди Эcкобар","Эcкобар","Эспириту-Санту","Эстевес","Эстрада","Эстрела","Фагундес","Фариа","Фариас","Фаринья","Фару","Фартариа","Фергейрас","Фернандес","Ферран","Феррейра","Фестас","Фиалью","Фидалгу","Фигейра","ди Фигейреду","Фигейреду","Фигейроа","Филипе","Флорес","да Фонсека","Фонсека","Фонтес","Фортунату","Фради","Фрага","Фрагозу","Франка","Франку","Фрейри","Фуртаду","Габейра","Галинду","Галван","Гама","Гамейру","Гаррау","Гарриду","Жентил","Жил","Годой","Гомес","Гонсалвес","Горжан","Граса","Гимарайнс","Гусман","Гутеррес","Энрикес","Игрежас","Империал","Жардин","ди Ласерда","Ласерда","Лаге","Лагус","Ламейра","Ланкастри",
#                  "Ларанжейра","Леал","Леон","Лемус","Ленкастри","Лима","Лисбоа","Лобу","Лопес","Маседу","Машаду","Мадейра","Мадурейра","Мальейру","Мангейра","Мараньян","Маринью","Маркес","Маррейру","Маррокин","Мартинью","Мартинс","Маскареньяс","Медина","Мелжасу","Мендес","ди Мендонса","Мендонса","Менесес","Минью","Миранда","ди Миранда","Мирандела","Монсанту","Монтейру","Мораис","Морейра","да Мота","Мота","Натал","Нейва","Нету","дас Невес","Невес","Нобри","Нунес","Оливарес","ди Оливейра","Оливейра","Озориу","Пашеку","Падилья","Паис","ди Пайва","Пайва","Пайшан","Палья","Пальярес","Палма","Палмейра","Параньюс","Педрозу","Пейшоту","Пенья","Пералта","Перейра","Перес","Пиньял","Пиньейру","Пинью","Пинту","Порту","Прада",
#                  "Праду","Кинтанилья","Кинтан","Рамалью","Раминьюс","Рамирес","Регейра","Рибас","Рибейру","Рику","Рижу","Риуш","да Роша","Роша","Родригес","Роза","ди Са","Са","Сабала","Саброза","Сакраменту","Салазар","Салес","Салгаду","Салваду","Сампайю","Саншес","Сантана","ди Сантарен","Сантарен","Сантьягу","Сантус","ди Сегейра","Сегейра","Силва","да Силва","Силвейра","ди Синтра","Синтра","Суарес","ди Соза","Соза","Таварес","Тавейра","Тейшейра","Терра","Тевеш","Томе","Валенти","Валгейру","Валверди","Варежан","Васкес","Вейга","Вентура","Видал","ди Виэйра","Виэйра","Вилалобус","Виланова","Виларинью","Вилаверди","Вивейрус","Шименес","Загалу","Бак","Бардини","Байер","Бенке","Беннерт","Берглер","Беретта","Бепплер","Бергман",
#                  "Брандт","Брезински","Брунелли","Шаплин","Кораделли","Ковалски","Делука","Десконьесида","Дреер","Эгер","Ферретти","Гессер","Клеттенберг","Левек","Ломбарди","Мартини","Молинари","Филиппи","Шмидт","Сташински","Тушински","Ван Дер Винне","Вагнер","Вебер"]
# Румынские и молдавские имена и фамилии -- 43,45
# Финские имена и фамилии -- 46,48
# Французские имена и фамилии -- 49,51,53
# Чешские имена и фамилии -- 50,54
# Шведские имена и фамилии -- 52,55
# Сербские и черногорские имена и фамилии -- 56,58
# Афганские имена и фамилии (?)
# Украинские имена и фамилии -- 60,63
# Грузинские имена и фамилии -- 64
# Армянские имена и фамилии -- 66
# Алжирские фамилии -- 71