class RandomTeam
  BUDGET = 2000000.0
  #TODO добавить бооольше схем
  SCHEMAS = {
  	'4-4-2>1' => { 0: 2, 1: 1, 2: 3, 3: 2, 4: 1, 5: 3, 6: 2, 7: 1, 8: 2, 9: 1 },
  	'4-4-2>2' => { 0: 2, 1: 2, 2: 3, 3: 1, 4: 2, 5: 3, 6: 1, 7: 1, 8: 2, 9: 1 },
  	'4-4-2>3' => { 0: 2, 1: 2, 2: 3, 3: 1, 4: 2, 5: 3, 6: 2, 8: 3 },
  	'4-4-2>4' => { 0: 2, 1: 2, 2: 3, 3: 2, 4: 2, 5: 3, 6: 1, 8: 3 }
  }

  def initialize(user)
  	main_country_id = user.country.id
    #TODO важный метод
    #используя player_generator (или схожий сделать) заполнить 18 игроков в команду,не более чем 2 млн
  end
end